[
  {
    "group": "leader",
    "name": "Judge Charles V. Johnson",
    "link": "https://raw.githubusercontent.com/101Ben/YLFContent/master/Charles%20V.%20Johnson.jpg",
    "bio": "Charles V. Johnson grew up in Arkansas in the 1930s and 1940s. After serving in the U.S.army for four years, he finished college in Arkansas.  He moved to Seattle in 1954 to attend law school at the University of Washington, one of only a handful of African American graduate students on the campus at that time.\n\nUpon graduating in 1957, Johnson was recruited by Jack Tanner, a law school colleague and President of the Northwest Branches of the NAACP, to revive the NAACP’s Seattle Chapter. Following a hugely successful membership drive, Johnson served a long and distinguished career with the NAACP: as president of the Seattle Chapter from 1959 to 1964, then president of the NAACP’s Northwest Area Conference from 1965 until the early 1970s, and finally as a member of the national NAACP’s Board of Directors from 1968 to 1995.\n\nJohnson also served as Chair of the Board that oversaw Model Cities in the late 1960s, served as a Municipal Court Judge from 1969 to 1980, and served as a Superior Court Judge from 1981 until his retirement in 1998."
  },
  {
    "group": "leader",
    "name": "Judge Norma S. Huggins",
    "link": "https://raw.githubusercontent.com/101Ben/YLFContent/master/Norma%20S.%20Huggins.jpeg",
    "bio": "Judge Norma S. Huggins represents the very best of what a judge should aspire to be. She is intelligent, fair, hard-working, compassionate, and decisive. Above all, she is a model of humility and grace.\nJudge Huggins presently sits on the bench of the King County Superior Court, where she has served since 1988. Prior to becoming a superior court judge, she was a judge on the Seattle Municipal Court. When she was appointed to that position in 1983, she became the first African American woman judge in the State of Washington.\n\nJudge Huggins began a nursing career after obtaining her nursing degree at Akron University in Ohio. She then attended the University of Arkansas, earning her Bachelor of Arts and Juris Doctor degree from that institution. Her legal career began as a trial attorney with Associated Counsel for the Accused, a private, nonprofit public defender firm in Seattle.\n\nJudge Huggins has an impressive mix of civil and judicial accomplishments. In 1991, she received the Totem Council Girl Scout of the Year Award. She also served as a People to People Delegate to Pacific Rim Countries on behalf of the America Judges' Association. She recently received the President's Award from the King County Chapter of Washington Women Lawyers. Prior to that, she received the Woman Judge of the Year Award from the National Bar Association.\n\nHer recent duty as one of the deans for Judicial Orientation for the Superior Court Judges' Association represents just one of her activities in the area of legal education. She has also served as an instructor in a variety of subject areas, including issues relating to domestic violence and other areas of criminal law.\n\nJudge Huggins has provided her time and ideas to a variety of organizations. Among them are the Washington State Minority and Justice Commission, the Washington State Gender and Justice Implementation Task Force, the Domestic Violence Task Force, and the Family Law Committee of the Superior Court Judges' Association. \n\nOne of the true measures of the success of a judge is how she is perceived by those who appear before her. In the case of Judge Huggins, the most frequently heard comments are that she is eminently fair and truly listens to those who appear before her. While defendants accused of crime do not always agree with the decisions that she makes, they usually believe that Judge Huggins has truly listened to what they have said.\n\nJudge Huggins is the proud mother of four adults, three daughters and a son. And she is particularly proud of her new grandchild.\n\nJudges and the greater public should be proud that Judge Huggins sits on the Superior Court bench. We all benefit from her service."
  },
  {
    "group": "leader",
    "name": "Judge LeRoy McCullough",
    "link": "https://raw.githubusercontent.com/101Ben/YLFContent/master/Pepe%20Leroy.jpg",
    "bio": "Currently assigned to the adult civil and criminal calendar through the Maleng Regional Justice Center (MRJC), Kent, Washington, Judge McCullough began service as a King County Superior Court Judge in 1989. This appointment and succeeding retention was preceded by his work as the Chief Hearing Examiner for Seattle land use and environmental issues, by his assignments as a State of Washington Assistant Attorney General, and by private practice. While on the bench, he has chaired such King County Superior Court Committees as the Jury, Courts and Community, and Personnel committees. In 2009 he was honored as Judge of the Year by the American Board of Trial Advocates (ABOTA) and by the King County Bar Association. Judge McCullough is a past President and Board member of the Loren Miller Bar Association, a Life Member of the NAACP, a proud member of Alpha Phi Alpha Fraternity, former Chair of the King County Library Board, and a past Executive Board member of the Meredith Mathews East Madison YMCA. Former Chief Judge of the MRJC and former presiding Judge of the King County Juvenile Drug Court, he considers himself a seasoned but progressive member of the Washington State Minority and Justice Commission and its Youth and Justice Committee.\n\nJudge McCullough holds undergraduate and law degrees from the University of Washington, Seattle, and certification from the National Judicial College, Reno, Nevada."
  },
  {
    "group": "speaker20",
    "name": "Michele E. Storms",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/michele.jpg",
    "bio": "Michele E. Storms is the Executive Director of the American Civil Liberties Union of Washington (ACLU of Washington), former Deputy Director of the ACLU of Washington, and previous Assistant Dean for Public Service and executive director of the William H. Gates Public Service Law program at the University of Washington School of Law.  Preceding those roles she served as a statewide advocacy coordinator first at Columbia Legal Services and later at the Northwest Justice Project where over a combined five-year period she coordinated civil legal aid advocacy in the areas of family law, youth and education, housing, elder law, Native American and right to counsel issues. She was also previously on faculty at the University of Washington School of Law where she founded what is now the Child and Youth Advocacy Clinic and taught several other courses. In addition to her service on numerous boards and guilds both locally and nationally, Michele served on the Washington State Access to Justice Board for six years and the board of One America. Michele is concerned with equity and justice for all and has dedicated her professional and personal attention to access to justice, preservation of freedom and democracy for all and ensuring that all humxns safely reside in the \"circle of human concern.\""
  },
  {
    "group": "speaker20",
    "name": "William Covington",
    "link": "https://www.law.uw.edu/media/141134/covington-william_compressed.jpg",
    "bio": "William Covington is a Senior Lecturer and directs the Technology, Law and Public Policy Clinic (Tech-Law Clinic) at the University of Washington School of Law. A graduate of New York University (1972) and the University of Michigan School of Law (1977), Covington has spent over twenty-five years working in technology-driven fields. He has served as regulatory counsel for Group W Cable and later in a similar capacity with McCaw Cellular Communications. Covington lead lobbying efforts, wrote or assisted in the writing of over twenty land use laws, served on numerous commissions and frequently appeared before federal, state and local regulatory bodies where he worked to create regulatory structures which balance public sector-private sector interests. \nThe Tech-Law Clinic provides students the opportunity for in-depth study of an area where technology and public policy converge. In the last five years Tech-Law clinicians have: drafted an Executive Order establishing Washington State’s Office of Privacy and Data Security; composed several bills regulating the testing of connected and autonomous vehicles; assisted the City of Bellevue and the University of Washington in assembling regulations governing Unmanned Aerial Vehicles (drones”); and assisted Washington State’s Chief Privacy Officer in crafting legislative proposals on the use of biometric data. Covington has co-chaired UW Law’s Dean’s Advisory Committee on Diversity, Equity and Inclusion and was a founding board member of the Washington State Bar Association’s Limited License Legal Technician program. He received the Dean’s Medal for Service in 2013."
  },
  {
    "group": "speaker20",
    "name": "Lara Okoloko",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/lara.jpg",
    "bio": "Lara Okoloko, LICSW is a licensed clinical social worker in Edmonds, Washington. She has a psychotherapy practice specializing in working with families impacted by a loved one's substance use problem. In addition to her therapy practice, Lara teaches in the MSW program at the University of Washington, provides supervision to clinical social workers working towards their license, and serves as the Past President of the Washington State Society for Clinical Social Work."
  },
  {
    "group": "speaker20",
    "name": "Matt Sanders",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/matt.jpg",
    "bio": "Matt Sanders is a supervising attorney for the King County Department of Public Defense, ACA Division.  He supervises the juvenile unit.  He brings an impressive set of career accomplishments to the role.  In 2019, after a two-month jury trial, he obtained an acquittal for a black father falsely accused of murder. Indeed, the  jury deliberated for less than two hours. For the past seven years, he has zealously defended clients in King County, taking dozens of cases to trial. He is regarded as one of the most accomplished trial attorneys at ACAD.  In addition to his stellar work as an attorney, Matt has shown a real commitment to social justice, volunteering regularly and graduating from the Washington Leadership Institute."
  },
  {
    "group": "speaker20",
    "name": "Matt Sanders",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/matt.jpg",
    "bio": "Fabienne 'Fae' Brooks retired after 26 years of service as Chief of the Criminal Investigation Division for the King County Sheriff’s Office. Since 2004, Chief Brooks has been a consultant on law enforcement/community relations and has developed specialized training for law enforcement officers and employees, leading a team of international trainers who are providing training in customer service and diversity to law enforcement and communities across the US and internationally in England and Switzerland. She is a member of the FBI National Academy Associates, the National Organization of Black Law Enforcement Executives (NOBLE), the Black Law Enforcement Association of Washington (BLEAW), NAACP and First AME Church. Married for 42 years to a retired Seattle Firefighter, family of 4 adult children, 10 grandchildren and 3 great-grandchildren."
  }
]
