[
  {
    "group": "leader",
    "name": "Judge Charles V. Johnson",
    "link": "https://raw.githubusercontent.com/101Ben/YLFContent/master/Charles%20V.%20Johnson.jpg",
    "bio": "Charles V. Johnson grew up in Arkansas in the 1930s and 1940s. After serving in the U.S.army for four years, he finished college in Arkansas.  He moved to Seattle in 1954 to attend law school at the University of Washington, one of only a handful of African American graduate students on the campus at that time.\n\nUpon graduating in 1957, Johnson was recruited by Jack Tanner, a law school colleague and President of the Northwest Branches of the NAACP, to revive the NAACP’s Seattle Chapter. Following a hugely successful membership drive, Johnson served a long and distinguished career with the NAACP: as president of the Seattle Chapter from 1959 to 1964, then president of the NAACP’s Northwest Area Conference from 1965 until the early 1970s, and finally as a member of the national NAACP’s Board of Directors from 1968 to 1995.\n\nJohnson also served as Chair of the Board that oversaw Model Cities in the late 1960s, served as a Municipal Court Judge from 1969 to 1980, and served as a Superior Court Judge from 1981 until his retirement in 1998."
  },
  {
    "group": "leader",
    "name": "Judge Norma S. Huggins",
    "link": "https://raw.githubusercontent.com/101Ben/YLFContent/master/Norma%20S.%20Huggins.jpeg",
    "bio": "Judge Norma S. Huggins represents the very best of what a judge should aspire to be. She is intelligent, fair, hard-working, compassionate, and decisive. Above all, she is a model of humility and grace.\nJudge Huggins presently sits on the bench of the King County Superior Court, where she has served since 1988. Prior to becoming a superior court judge, she was a judge on the Seattle Municipal Court. When she was appointed to that position in 1983, she became the first African American woman judge in the State of Washington.\n\nJudge Huggins began a nursing career after obtaining her nursing degree at Akron University in Ohio. She then attended the University of Arkansas, earning her Bachelor of Arts and Juris Doctor degree from that institution. Her legal career began as a trial attorney with Associated Counsel for the Accused, a private, nonprofit public defender firm in Seattle.\n\nJudge Huggins has an impressive mix of civil and judicial accomplishments. In 1991, she received the Totem Council Girl Scout of the Year Award. She also served as a People to People Delegate to Pacific Rim Countries on behalf of the America Judges' Association. She recently received the President's Award from the King County Chapter of Washington Women Lawyers. Prior to that, she received the Woman Judge of the Year Award from the National Bar Association.\n\nHer recent duty as one of the deans for Judicial Orientation for the Superior Court Judges' Association represents just one of her activities in the area of legal education. She has also served as an instructor in a variety of subject areas, including issues relating to domestic violence and other areas of criminal law.\n\nJudge Huggins has provided her time and ideas to a variety of organizations. Among them are the Washington State Minority and Justice Commission, the Washington State Gender and Justice Implementation Task Force, the Domestic Violence Task Force, and the Family Law Committee of the Superior Court Judges' Association. \n\nOne of the true measures of the success of a judge is how she is perceived by those who appear before her. In the case of Judge Huggins, the most frequently heard comments are that she is eminently fair and truly listens to those who appear before her. While defendants accused of crime do not always agree with the decisions that she makes, they usually believe that Judge Huggins has truly listened to what they have said.\n\nJudge Huggins is the proud mother of four adults, three daughters and a son. And she is particularly proud of her new grandchild.\n\nJudges and the greater public should be proud that Judge Huggins sits on the Superior Court bench. We all benefit from her service."
  },
  {
    "group": "leader",
    "name": "Judge LeRoy McCullough",
    "link": "https://raw.githubusercontent.com/101Ben/YLFContent/master/Pepe%20Leroy.jpg",
    "bio": "Currently assigned to the adult civil and criminal calendar through the Maleng Regional Justice Center (MRJC), Kent, Washington, Judge McCullough began service as a King County Superior Court Judge in 1989. This appointment and succeeding retention was preceded by his work as the Chief Hearing Examiner for Seattle land use and environmental issues, by his assignments as a State of Washington Assistant Attorney General, and by private practice. While on the bench, he has chaired such King County Superior Court Committees as the Jury, Courts and Community, and Personnel committees. In 2009 he was honored as Judge of the Year by the American Board of Trial Advocates (ABOTA) and by the King County Bar Association. Judge McCullough is a past President and Board member of the Loren Miller Bar Association, a Life Member of the NAACP, a proud member of Alpha Phi Alpha Fraternity, former Chair of the King County Library Board, and a past Executive Board member of the Meredith Mathews East Madison YMCA. Former Chief Judge of the MRJC and former presiding Judge of the King County Juvenile Drug Court, he considers himself a seasoned but progressive member of the Washington State Minority and Justice Commission and its Youth and Justice Committee.\n\nJudge McCullough holds undergraduate and law degrees from the University of Washington, Seattle, and certification from the National Judicial College, Reno, Nevada."
  },
  {
    "group": "current",
    "name": "Nicholas Brown",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/nickbrown.jpg",
    "bio": "Nick Brown is a Partner with Pacifica Law Group LLP, where he focuses on complex civil and regulatory litigation, municipal law, public policy, and political matters. He is a former Army JAG attorney who spent six years in the U.S. Attorney’s office in Seattle, and served as the General Counsel and principal legal advisor to Washington Governor Jay Inslee from 2013-17. Mr. Brown has served as a board member of the Washington Leadership Institute, the Campaign for Equal Justice, Treehouse, a Commissioner on the Seattle Ethics and Elections Commission, and as co-chair of the Federal Judicial Selection Committee for the Western District of Washington and serves as. In 2014 Mr. Brown was named by Seattle Magazine as one of the year’s Most Influential People for his leading work on Governor Inslee’s moratorium on the use of the death penalty in Washington State. He holds a B.A. in Political Science and Government from Morehouse College and earned his J.D. from Harvard Law School. In July 2021, Mr. Brown was nominated by President Joe Biden to serve as the United States Attorney for the Western District of Washington."
  },
  {
    "group": "speakers",
    "name": "Michele E. Storms",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/michele.jpg",
    "bio": "Michele E. Storms is the Executive Director of the American Civil Liberties Union of Washington (ACLU of Washington), former Deputy Director of the ACLU of Washington, and previous Assistant Dean for Public Service and executive director of the William H. Gates Public Service Law program at the University of Washington School of Law.  Preceding those roles she served as a statewide advocacy coordinator first at Columbia Legal Services and later at the Northwest Justice Project where over a combined five-year period she coordinated civil legal aid advocacy in the areas of family law, youth and education, housing, elder law, Native American and right to counsel issues. She was also previously on faculty at the University of Washington School of Law where she founded what is now the Child and Youth Advocacy Clinic and taught several other courses. In addition to her service on numerous boards and guilds both locally and nationally, Michele served on the Washington State Access to Justice Board for six years and the board of One America. Michele is concerned with equity and justice for all and has dedicated her professional and personal attention to access to justice, preservation of freedom and democracy for all and ensuring that all humxns safely reside in the \"circle of human concern.\""
  },
  {
    "group": "speakers",
    "name": "William Covington",
    "link": "https://www.law.uw.edu/media/141134/covington-william_compressed.jpg",
    "bio": "William Covington is a Senior Lecturer and directs the Technology, Law and Public Policy Clinic (Tech-Law Clinic) at the University of Washington School of Law. A graduate of New York University (1972) and the University of Michigan School of Law (1977), Covington has spent over twenty-five years working in technology-driven fields. He has served as regulatory counsel for Group W Cable and later in a similar capacity with McCaw Cellular Communications. Covington lead lobbying efforts, wrote or assisted in the writing of over twenty land use laws, served on numerous commissions and frequently appeared before federal, state and local regulatory bodies where he worked to create regulatory structures which balance public sector-private sector interests. \nThe Tech-Law Clinic provides students the opportunity for in-depth study of an area where technology and public policy converge. In the last five years Tech-Law clinicians have: drafted an Executive Order establishing Washington State’s Office of Privacy and Data Security; composed several bills regulating the testing of connected and autonomous vehicles; assisted the City of Bellevue and the University of Washington in assembling regulations governing Unmanned Aerial Vehicles (drones”); and assisted Washington State’s Chief Privacy Officer in crafting legislative proposals on the use of biometric data. Covington has co-chaired UW Law’s Dean’s Advisory Committee on Diversity, Equity and Inclusion and was a founding board member of the Washington State Bar Association’s Limited License Legal Technician program. He received the Dean’s Medal for Service in 2013."
  },
  {
    "group": "speakers",
    "name": "Lara Okoloko",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/lara.jpg",
    "bio": "Lara Okoloko, LICSW is a licensed clinical social worker in Edmonds, Washington. She has a psychotherapy practice specializing in working with families impacted by a loved one's substance use problem. In addition to her therapy practice, Lara teaches in the MSW program at the University of Washington, provides supervision to clinical social workers working towards their license, and serves as the Past President of the Washington State Society for Clinical Social Work."
  },
  {
    "group": "speakers",
    "name": "Logic Amen",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/logic.jpg",
    "bio": "Logic Amen is a sun, Father, recording artist, journalist, writer, educator and former Family Preservation Therapist. Amen has a degree in English Literature, a master's in teaching, and a master's in education all leadership. Amen is one of the founding members of CORE which stands for Coalition of Restorative Education. Amen considers himself to be a visionary learner and created the Griot Party Experience to support healing in the community via story telling. Amen seeks to help the people he serves feel safe and important. His life mission places a high premium on healing via education. Amen is currently serving as an assistant principal at Lincoln High school in Tacoma Washington. He lives in Seattle Washington."
  },
  {
    "group": "speakers",
    "name": "Matt Sanders",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/matt.png",
    "bio": "Matt Sanders is a supervising attorney for the King County Department of Public Defense, ACA Division.  He supervises the juvenile unit.  He brings an impressive set of career accomplishments to the role.  In 2019, after a two-month jury trial, he obtained an acquittal for a black father falsely accused of murder. Indeed, the  jury deliberated for less than two hours. For the past seven years, he has zealously defended clients in King County, taking dozens of cases to trial. He is regarded as one of the most accomplished trial attorneys at ACAD.  In addition to his stellar work as an attorney, Matt has shown a real commitment to social justice, volunteering regularly and graduating from the Washington Leadership Institute."
  },
  {
    "group": "speakers",
    "name": "Fabienne Brooks",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/fae.png",
    "bio": "Fabienne 'Fae' Brooks retired after 26 years of service as Chief of the Criminal Investigation Division for the King County Sheriff’s Office. Since 2004, Chief Brooks has been a consultant on law enforcement/community relations and has developed specialized training for law enforcement officers and employees, leading a team of international trainers who are providing training in customer service and diversity to law enforcement and communities across the US and internationally in England and Switzerland. She is a member of the FBI National Academy Associates, the National Organization of Black Law Enforcement Executives (NOBLE), the Black Law Enforcement Association of Washington (BLEAW), NAACP and First AME Church. Married for 42 years to a retired Seattle Firefighter, family of 4 adult children, 10 grandchildren and 3 great-grandchildren."
  },
  {
    "group": "speakers",
    "name": "Nefertiti Harmon Durant, MD, MPH",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/durant.jpg",
    "bio": "The vision of the Center for Clinical and Translational Science (CCTS)  is to reduce the burden of disease and disparities in diseases that are disproportionately represented in the Deep South while seeking to improve human health.  My research focuses on two areas: promotion of physical activity in adolescent and young adults through technology based interventions and examination of the correlates of cardiovascular disease and obesity in underrepresented minorities and young adults. Thus my work fits within the context of the CCTS mission.  As a member of the CCTS, I am a recipient of a CCTS pilot award. Data from my CCTS pilot award led to a Robert Wood Johnson Physician Faculty Scholars Grant and an American Heart Association Scientific Development Award. \nIn my role as an Associate Professor of Pediatrics at the University of Alabama at Birmingham School of Medicine, I have mentored over 40 trainees in clinical medicine and research. In my role as mentor, my trainees’ education and research has focused primarily on reduction in disparities in physical activity and cardiovascular disease in adolescents in young adults.  My research mentees have included four mentees at the doctoral level, four at the doctoral level and four at the post-doctoral level.  Four of my trainees are currently on faculty in academic settings with 1 holding a K award and one holding and R01."
  },
  {
    "group": "speakers",
    "name": "Matthew Roberson",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/roberson.png",
    "bio": "Officer Matthew Roberson has worked for SPD for 8+ years now. Started out as a patrol officer in the Georgetown/SODO neighborhood. His current assignment is in Community Outreach with a focus on youth violence prevention/intervention, mentorship, and relationship building activities through the Seattle Police Activities League (SEAPAL). \nHe attended Garfield High School and graduated from Claremont Mckenna College. Prior to joining SPD, Matthew did environmental education with High school students with AmeriCorps for a year. \nAfter AmeriCorps, Matthew Worked for Seattle Parks and Recreation running the South Park Teen Program and Late Night at several south Seattle locations.\nHis hobbies/interests and include – Reading Sci-Fi books, video games, coaching track and field, playing sports, and building haunted houses"
  },
  {
    "group": "speakers",
    "name": "John F. Hayes\nCaptain, Seattle Police Department",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/hayes.png",
    "bio": "Captain John F. Hayes, Jr. was born and raised in Seattle. He is a 38-year veteran of the Seattle Police Department. His career encompasses a diverse range of responsibilities and experience, most recently as Captain for SPD of the Audit, Research, & Policy Section. Captain Hayes is a graduate of the University of Washington, earning a Bachelor’s Degree in Social Welfare and Women’s Studies and a Master’s Degree in Social Work. \nCaptain Hayes has served as an advisor for the University of Chicago School of Social Services Administration gang program: National Youth Gang Suppression and Intervention and was appointed by the Governor of Washington to the State Task Force on Children’s Justice. Captain Hayes has been an instructor, facilitator and guest presenter for the Washington State Bar Association’s Washington Criminal Justice Institute Conference, The King County Bar Association, Seattle University, University of Washington, numerous schools, churches and organizations within the community. He has trained thousands of people, both locally and nationally, in the areas of family and youth intervention services, gang violence, youth truancy and more specifically, in working with high-risk juvenile populations. \nIn 2011, Captain Hayes was honored by his high school alma mater, Bishop Blanchet High School in Seattle, as a Distinguished Alumni. This same year he was also recognized as the first recipient of the University of Washington’s Department of Gender, Women & Sexuality Distinguished Alumni award. In 2013 he was inducted into the Blanchet High School Hall of Fame. In June 2016 he graduated from the FBI National Academy, graduate level. \nCaptain Hayes continues to use his expertise in community organizing, outreach and problem solving to address many of the concerns facing communities today, He is a life member of the NAACP, former National Chair of the National Black Police Association and a former president of the Black Law Enforcement Association of Washington."
  },
  {
    "group": "speakers",
    "name": "Kwatasian P. Hunt \nMusic Bio",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/tasia.jpg",
    "bio": "The refreshing, melodious, vibrant sound of Kwatasian Hunt is one of the most powerful, distinct voices in gospel music. With hundreds of performances under her belt, she's performed to the likes of national governmental dignitaries in Alabama and Washington, D.C. She has shared the stage with some of the greatest names in gospel music such as Tye Tribbett, Angela Spivey, Donnie McClurkin, Vashawn Mitchell and Marvin Sapp. Kwatasian has provided live background for Donald Lawrence, Lady Tramaine Hawkins, Beverly Crawford and LaCresia Campbell and Kim Burrell, Byron Cage and Ted Wynn. \nOn July 11, 2013, Kwatasian Hunt released her first single \"What Gain\" featuring Dove Award Winner, Grammy and Stellar Nominee Antonio Neal. Bishop Hezekiah Walker, National Gospel Recording artist and song writer has credited Kwatasian’s voice as \"anointed.\" \nGrowing up, Kwatasian was exposed to different genres of music and developed an affinity towards classical and gospel music. Kwatasian’s music ministry has taken her to both national and international platforms. With her distinct sound, she has captured the attention of listeners around the world. Kwatasian was nominated for and won the Alabama People’s Choice Award for Contemporary Artist of the Year. She was also nominated for Montgomery’s Best Female Soloist, Voices of Gospel Music Awards Female Vocalist of the Year and Praise and Worship Leader. Kwatasian also received the Church Girls Rock Award for her contributions to the community. She has ministered to millions as she was interviewed and sang on Trinity Broadcast Network! Three of her most recent assignment were ministering at the National Holy Convocation for the Church of God in Christ's Official Day, singing with the Seattle Repertory Jazz Orchestra for the 30th Duke Ellington Sacred Music Concert in Seattle, WA and the Church of God in Christ Women’s International Conference in Baltimore, MD. \nKwatasian’s ministry is direct and her focus is clear. \"The music ministry that God placed inside of me has been birthed and will undoubtedly reach generations to come. It's no longer just an emotional ballad; my music is designed to touch the depths of souls that one may seek a closer relationship with Christ.\" \nKwatasian holds a bachelor’s degree in Psychology from Troy University and a Master's in Human Services from Amridge University. One of her greatest career achievements was developing and implementing the Education & Training Institute with her former employer. She now holds the position of State of Alabama's Employee Assistance Program Coordinator.This musical jewel offers the world not just another song, but a powerful ministry and substance for the nations. Kwatasian serves in her community and is an active member of New Life COGIC, its choir and praise & worship team. She is married to Theodore Hunt and together they share four beautiful children. Kwatasian currently resides in Alabama."
  },
  {
    "group": "speakers",
    "name": "Mark Solomon\nCrime Prevention Coordinator",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/solomon.png",
    "bio": "Mark Solomon is a Crime Prevention Coordinator for the Seattle Police Department.  A Seattle native, Mark has been with the Department for over 30 years, working with community groups, individuals and businesses on public safety issues, and quality of life issues that impact public safety.  \nMark is a retired United States Air Force Lieutenant Colonel where he served as an intelligence Analyst and Senior Intelligence Officer.  He was also the founder of Obsidian Security Group, a Seattle based security staffing and consulting enterprise.  Mark currently serves on the Boards of the Beacon Hill Council and YouthCare (an organization serving homeless youth working to move them to stable housing education and employment).  Mark also serves as Vice President of the Washington State Chapter of the National Organization of Black Law Enforcement Executives (NOBLE), and as a Regional Director of the Washington State Crime Prevention Association (WSCPA).  Mark lives in the Beacon Hill Neighborhood of Seattle with his wife, Suzanne (a high school art teacher), in the home his grandparents built.  Mark is an admitted Sci-Fi and comic book nerd."
  },
  {
    "group": "speakers",
    "name": "Detective D. Cookie Bouldin\nYouth Violence Prevention/Community Outreach Unit",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/cookie.png",
    "bio": "Detective “Cookie” is a 40-year veteran of the Seattle Police Department currently in the Youth Violence Prevention/Community Outreach Unit. Detective Cookie is a Youth Specialist, working closely with youth of all ages as well as the community at large. \nDetective Cookie started the “Detective Cookie’s Urban Youth Chess Club” fourteen years ago in 2006 and it has become a very successful program. She also interacts with youth through her after school programs and the Seattle National Police Activities League (SEAPAL) as a mentor to youth.\nShe is a member of the National Organization of Black Law Enforcement Executives and a member of the Black Law Enforcement Association of Washington. \nDetective Cookie was a professional model for many years before becoming a police officer"
  },
  {
    "group": "speakers",
    "name": "Aaron Lucas\nYouth Violence Prevention Unit",
    "link": "https://raw.githubusercontent.com/YouthandLaw/YLFContent/master/speaker20/lucas.png",
    "bio": "Aaron Lucas is a Seattle Police Officer, currently in the Youth Violence Prevention Unit.  Aaron has been with the department for ten years, first five years on patrol and last five years working in schools as a School Emphasis Officer. Also, over the ten years, engaged with youth through Late Night Programs and Seattle National Police Activities League (SeaPAL) as a mentor to youth.\nAaron completed four years with the U.S. Navy (US Nimitz CVN-68), seven years as a Metro Transit Operator and owning his own barbershop in the Central District of Seattle for 15 years. Currently, Aaron serves as an Elder at Community Bible Fellowship as the Youth Leader, married for 29 years and continues to look for ways to be a valuable asset in the community he serves."
  }
]
